In [8]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame([[1,2,3], [4,5,6],[7,8,9], [10,11,12]], columns=["A","B","C"], index=['x','y','z','zz'])

In [6]:
df.head()

     A   B   C
x    1   2   3
y    4   5   6
z    7   8   9
zz  10  11  12

In [7]:
df.tail(3)

     A   B   C
y    4   5   6
z    7   8   9
zz  10  11  12

In [8]:
df.describe()

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [9]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [10]:
df.index

Index(['x', 'y', 'z', 'zz'], dtype='object')

In [10]:
df.nunique()

A    4
B    4
C    4
dtype: int64

In [11]:
#Loading Data from data frames
coffee = pd.read_csv('./warmup-data/coffee.csv')

In [9]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [10]:
coffee.describe()

       Units Sold
count   14.000000
mean    32.857143
std      9.346798
min     15.000000
25%     26.250000
50%     35.000000
75%     38.750000
max     45.000000

In [11]:
coffee.tail()

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [16]:
coffee.loc()

In [30]:
#view sample of rows , make it deterministic i.e repeatable
coffee.sample(14, random_state=1)

          Day Coffee Type  Units Sold
3     Tuesday       Latte          20
7    Thursday       Latte          30
6    Thursday    Espresso          40
2     Tuesday    Espresso          30
10   Saturday    Espresso          45
4   Wednesday    Espresso          35
1      Monday       Latte          15
12     Sunday    Espresso          45
0      Monday    Espresso          25
13     Sunday       Latte          35
9      Friday       Latte          35
8      Friday    Espresso          45
11   Saturday       Latte          35
5   Wednesday       Latte          25

In [20]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [34]:
#Filter data frame by rows and columns
coffee.loc[[0,1,2]]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [40]:
#Slice data from one index to another
coffee.loc[0:14]

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [ ]:
coffee.loc[5:8,["Day", "Units Sold" ,] ]

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45

In [57]:
coffee[coffee["Coffee Type"] == "Latte"].loc[5:9]

         Day Coffee Type  Units Sold
5  Wednesday       Latte          25
7   Thursday       Latte          30
9     Friday       Latte          35

In [12]:
#Filter using index location
coffee[coffee["Coffee Type"] == "Latte"].iloc[0:10]

          Day Coffee Type  Units Sold
1      Monday       Latte          15
3     Tuesday       Latte          20
5   Wednesday       Latte          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35

In [28]:
#More filters
coffee.loc["Monday": "Wednesday", "Units Sold"]

Series([], Name: Units Sold, dtype: int64)

In [34]:
coffee = pd.read_csv('./warmup-data/coffee.csv')
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [40]:
#Modify data, change values in the day at index 0 & 1
coffee.loc[0, "Units Sold"] = 30
coffee.loc[1, "Units Sold"] = 50
coffee.head()

         Day Coffee Type  Units Sold  Units Sold
0     Monday    Espresso          30          NaN
1     Monday       Latte          50         30.0
2    Tuesday    Espresso          30          NaN
3    Tuesday       Latte          20          NaN
4  Wednesday    Espresso          35          NaN

In [42]:
#Set Multiple values /modify 
coffee.loc[0:3, "Units Sold"] = 20
coffee.head()

         Day Coffee Type  Units Sold  Units Sold
0     Monday    Espresso          20          NaN
1     Monday       Latte          20         30.0
2    Tuesday    Espresso          20          NaN
3    Tuesday       Latte          20          NaN
4  Wednesday    Espresso          35          NaN

In [47]:
#Sort values by column names,
coffee.sort_values("Units Sold", ascending=False)

          Day Coffee Type  Units Sold  Units Sold
10   Saturday    Espresso          45          NaN
8      Friday    Espresso          45          NaN
12     Sunday    Espresso          45          NaN
6    Thursday    Espresso          40          NaN
4   Wednesday    Espresso          35          NaN
11   Saturday       Latte          35          NaN
13     Sunday       Latte          35          NaN
9      Friday       Latte          35          NaN
7    Thursday       Latte          30          NaN
5   Wednesday       Latte          25          NaN
2     Tuesday    Espresso          20          NaN
3     Tuesday       Latte          20          NaN
0      Monday    Espresso          20          NaN
1      Monday       Latte          20         30.0

In [55]:
#Sort by multiple values
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[0,1])

          Day Coffee Type  Units Sold  Units Sold
8      Friday    Espresso          45          NaN
10   Saturday    Espresso          45          NaN
12     Sunday    Espresso          45          NaN
6    Thursday    Espresso          40          NaN
4   Wednesday    Espresso          35          NaN
9      Friday       Latte          35          NaN
11   Saturday       Latte          35          NaN
13     Sunday       Latte          35          NaN
7    Thursday       Latte          30          NaN
5   Wednesday       Latte          25          NaN
0      Monday    Espresso          20          NaN
2     Tuesday    Espresso          20          NaN
1      Monday       Latte          20         30.0
3     Tuesday       Latte          20          NaN

In [61]:
#iterate row by row
for index , row in coffee.iterrows():
  print (index)
  print (row['Coffee Type'])
  print("\n")

0
Espresso


1
Latte


2
Espresso


3
Latte


4
Espresso


5
Latte


6
Espresso


7
Latte


8
Espresso


9
Latte


10
Espresso


11
Latte


12
Espresso


13
Latte

In [66]:
#Filtering data and Mnipulate
bios = pd.read_csv("./data/bios.csv")
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [67]:
bios.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [68]:
#View data type
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [ ]:
#Filter data  by weight and height 
bios.loc[bios["height_cm"] > 215, ["name", "born_date", "height_cm","weight_kg" ]]
bios.loc[bios["height_cm"] > 215, ["name", "born_date", "height_cm","weight_kg" ]]

                         name   born_date  height_cm  weight_kg
5089       Viktor Pankrashkin  1957-06-19      220.0      112.0
5583     Paulinho Villas Boas  1963-01-26      217.0      106.0
5673           Gunther Behnke  1963-01-19      221.0      114.0
5716                 Uwe Blab  1962-03-26      218.0      110.0
5781           Tommy Burleson  1952-02-24      223.0      102.0
5796            Andy Campbell  1956-07-21      218.0       93.0
6223              Lars Hansen  1954-09-27      216.0      105.0
6270              Hu Zhangbao  1963-04-05      216.0      135.0
6409         Sergey Kovalenko  1947-08-11      216.0      111.0
6420            Jnis Krmi  1930-01-30      218.0      141.0
6504              Luc Longley  1969-01-19      220.0      135.0
6722         Shaquille O'Neal  1972-03-06      216.0      137.0
6937           David Robinson  1965-08-06      216.0      107.0
6978          Arvydas Sabonis  1964-12-19      223.0      122.0
7074           Paulo da Silva  1963-07-21      217.0      106.0
7188       Vladimir Tkachenko  1957-09-20      220.0      110.0
7281         Stojko Vrankovi  1964-01-22      217.0      115.0
7376      Eurelijus ukauskas  1973-08-22      218.0      115.0
52608         Aleksey Kazakov  1976-03-18      217.0      102.0
82100           Frdric Weis  1977-06-22      218.0      110.0
89070                Yao Ming  1980-09-12      226.0      141.0
89075          Roberto Dueas  1975-11-01      221.0      137.0
107408       Peter John Ramos  1985-05-23      219.0      113.0
112312           Stanko Bara  1986-08-13      217.0      110.0
112332    Andreas Glyniadakis  1981-08-26      216.0      115.0
112337          Hamed Haddadi  1985-05-19      218.0      110.0
118663         Timofey Mozgov  1986-07-16      216.0      113.0
118676        Dmitry Musersky  1988-10-29      219.0      104.0
120266           Zhang Zhaoxu  1987-11-18      221.0      110.0
121694            Salah Mejri  1986-06-15      216.0      110.0
123850         Tyson Chandler  1982-10-02      216.0      107.0
130460               Li Muhao  1992-06-02      218.0      115.0
130461                Zhou Qi  1996-01-16      217.0       95.0
138671          Ondej Balvn  1992-09-20      216.0      107.0
139365         Moustapha Fall  1992-02-23      218.0        NaN

In [ ]:
#Alternative filtering method
bios[bios['height_cm'] > 215][['name', 'weight_kg', 'born_date']]

                         name  weight_kg   born_date
5089       Viktor Pankrashkin      112.0  1957-06-19
5583     Paulinho Villas Boas      106.0  1963-01-26
5673           Gunther Behnke      114.0  1963-01-19
5716                 Uwe Blab      110.0  1962-03-26
5781           Tommy Burleson      102.0  1952-02-24
5796            Andy Campbell       93.0  1956-07-21
6223              Lars Hansen      105.0  1954-09-27
6270              Hu Zhangbao      135.0  1963-04-05
6409         Sergey Kovalenko      111.0  1947-08-11
6420            Jnis Krmi      141.0  1930-01-30
6504              Luc Longley      135.0  1969-01-19
6722         Shaquille O'Neal      137.0  1972-03-06
6937           David Robinson      107.0  1965-08-06
6978          Arvydas Sabonis      122.0  1964-12-19
7074           Paulo da Silva      106.0  1963-07-21
7188       Vladimir Tkachenko      110.0  1957-09-20
7281         Stojko Vrankovi      115.0  1964-01-22
7376      Eurelijus ukauskas      115.0  1973-08-22
52608         Aleksey Kazakov      102.0  1976-03-18
82100           Frdric Weis      110.0  1977-06-22
89070                Yao Ming      141.0  1980-09-12
89075          Roberto Dueas      137.0  1975-11-01
107408       Peter John Ramos      113.0  1985-05-23
112312           Stanko Bara      110.0  1986-08-13
112332    Andreas Glyniadakis      115.0  1981-08-26
112337          Hamed Haddadi      110.0  1985-05-19
118663         Timofey Mozgov      113.0  1986-07-16
118676        Dmitry Musersky      104.0  1988-10-29
120266           Zhang Zhaoxu      110.0  1987-11-18
121694            Salah Mejri      110.0  1986-06-15
123850         Tyson Chandler      107.0  1982-10-02
130460               Li Muhao      115.0  1992-06-02
130461                Zhou Qi       95.0  1996-01-16
138671          Ondej Balvn      107.0  1992-09-20
139365         Moustapha Fall        NaN  1992-02-23

In [ ]:
#Filter with multiple values